#!/bin/bash
###########################################################
# Function  :将当前文件夹中大于100k的文件移动到~/tmp中         #
# Date      :2021-12-16                                   #
# Author    :庄毅非                                        #
# studentID :3200105872                                   #
###########################################################
# 使用find命令，maxdepth规定不对子目录进行递归搜索（如果需要进行递归搜索的话，请将"-maxpth 1"删去），使用-type指定为文件类型，使用-size +100k表示文件大小应该大于100k
# 此后使用xargs命令，将符合条件的文件移动至~/tmp中
find . -maxdepth 1 -type f -size +100k | xargs -I {} mv {} ~/tmp
